app/views/flights/new.html.erb

SELECT "airports".* FROM "airports"
---
  <%= f.label :departure_city %>
  <%= f.collection_select :departure_city, Airport.all, :city, :city %>

SELECT  "airports".* FROM "airports" ORDER BY "airports"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  <%= f.label :arrival_city %>
  <%= f.collection_select :arrival_city, Airport.all, :city, :city %>