app/controllers/customers_controller.rb

  def create
    @customer = Customer.create(customer_params)
---
INSERT INTO "customers" ("first_name", "last_name", "passport", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_name", "Joseph"], ["last_name", "Gao"], ["passport", 88888888], ["created_at", "2019-02-11 14:15:12.575301"], ["updated_at", "2019-02-11 14:15:12.575301"]]

  def show
    @customer = Customer.find(params[:id])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]