app/controllers/flights_controller.rb

  def index
    @flights = Flight.all
---
SELECT "flights".* FROM "flights"

  def create
    @flight = Flight.create(flight_params)
---
INSERT INTO "flights" ("departure_city", "arrival_city", "departure_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["departure_city", "Birmingham"], ["arrival_city", "Barrow"], ["departure_date", "02/11/2019"], ["created_at", "2019-02-11 22:46:48.599266"], ["updated_at", "2019-02-11 22:46:48.599266"]]

  def show
    @flight = Flight.find(params[:id])
---
SELECT  "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]